Revit 2024 API
UIControlledApplication.ControlledApplication Property
Returns the database level ControlledApplication represented by this UI-level ControlledApplication.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public ControlledApplication ControlledApplication { get; }
Visual Basic
Public ReadOnly Property ControlledApplication As ControlledApplication
	Get
Visual C++
public:
property ControlledApplication^ ControlledApplication {
	ControlledApplication^ get ();
}
See Also
UIControlledApplication Class
Autodesk.Revit.UI Namespace